PAID_STATUS_RESPONSE_MESSAGE = ('Замовлення сплачене, незабаром склад це побачить та прийме його в чергу для '
                                'подальшої обробки та відправки. Ми відправимо тобі смс, щойно все буде готово '
                                '😉\n\nАбо, якщо хочеш - я можу сповістити тобі про зміни статусу замовлення тут, в '
                                'цьому чаті.Для цього активуй кнопку слідкування за замовленням ⬇️')

WAIT_ORDER_STATUS_START_TEXT = "Все, я починаю шпигувати 👻\nЩойно замовлення змінить статус, сповіщу тобі тут.\nВ " \
                               "будь-який момент ти можешь припинити мою кар'єру шпигуна натиснувши"\
                                " кнопку <b>Зупинити слідкування</b>  🤫"

ORDER_NOT_FOUND_BY_ORDER_ID_TEXT = "Щось я не можу знайти твоє замовлення за номером телефону 🤔\nДавай спробуємо" \
                                   " знайти за ""номером замовлення? 🤔 \nНатисни нижче на кнопку"

ORDER_TTN_IS_NONE = "Це замовлення виконано.\nМожливо, ти залишав декілька замовлень та ми об'єднали їх в одну " \
                    "посилку 🤔\nЯкщо це так - спробуй ввести номер іншого замовлення та я надам тобі інформацію 😉"

ORDER_NUMBER_VALIDATION_TEXT = "Щось не те ввів 👀\nНомер замовлення - це дев'ятизначнечисло, " \
                               "зазвичай починається з 2 або 3."

CASH_PAYMENT_OPTIONS = 'Замовлення нове, ми ще не встигли його побачити, але не хвилюйся, за цим ми слідкуємо частіше ' \
                       'ніж за новими відео в тікток 🫢\n\nНезабаром склад все побачить та прийме замовлення в чергу ' \
                       'для' \
                       'подальшої обробки та відправки.\n\nТо ж наразі тобі нічого робити не потрібно. Ми відправимо ' \
                       'тобі ' \
                       'смс, щойно все буде готово 😉\n\nАбо, якщо хочеш - я можу сповістити тобі про зміни статусу ' \
                       'замовлення тут, в цьому чаті. Для цього активуй кнопку слідкування за замовленням ⬇️'

CARD_PAYMENT_OPTIONS = ('Замовлення нове, ми ще не встигли його побачити, але не хвилюйся, за цим ми слідкуємо частіше '
                        'ніж за новими відео в тікток 🫢\n\nНезабаром склад все побачить та прийме замовлення в чергу '
                        'для '
                        'подальшої обробки та відправки.\n\nТо ж наразі тобі нічого робити не потрібно. Ми відправимо '
                        'тобі '
                        'смс на вайбер або телеграм з реквизитами на оплату, щойно замовлення буде фізично готовим '
                        '😉\n\n'
                        'Або, якщо хочеш - я можу сповістити тобі про зміни статусу замовлення тут, в цьому чаті. Для '
                        'цього активуй кнопку слідкування за замовленням ⬇️')

WAITING_FOR_PAYMENT_STATUS_OPTION = ("Твоє замовлення вже зібране, та посилочка чекає на відправку найближчим часом "
                                     "😇\n\nЗгодом ми напишемо тобі всю інформацію та реквізити для оплати. Можливо ми"
                                     " тобі вже написали це, перевір повідомлення в вайбер/телеграм 👀\n\nЯкщо ж "
                                     "повідомлення досі немає - не хвилюйся, ймовірно ми зайняті, але обов'язково "
                                     "напишемо тобі трішки згодом.\n\nНесвоєчасна оплата ніяк не впливатиме на "
                                     "термін відправки посилки. Навіть якщо ти не сплатив за замовлення вчасно - "
                                     "ми всеодно відправимо тобі посилочку якомога швидше 😉")



WAIT_ORDER_STATUS_TEXT = ("Я вмію слідкувати за зміною статусу замовлення 🤫\nХочеш зробимо це?\n\nНатисні нижче"
                          " відслідковувати, і я сповіщатиму тобі щойно твоє замовлення отримає новий статус 😊")

DUPLICATE_ORDER_TEXT = ("Ми скасували це замовлення, оскільки побачили твоє інше замовлення, якє є більш актуальним."
                        "\nТи можеш слідкувати за своїм актуальним замовленням натиснувши кнопки нижче ⬇️")

CANT_CONTACT_USER_TEXT = ("Ми скасували це замовлення, оскільки не змогли ніяк зв'язатись з тобою.\nЯкщо замовлення "
                          "актуальне - будь ласка напиши нам в <a href='https://t.me/lalavape'>Телеграм</a>")

OTHER_CANCELS_REASON_TEXT = ("Замовлення скасовано.\nЯкщо в тебе залишились питання - "
                             "будь ласка напиши нам в <a href='https://t.me/lalavape'>Телеграм</a>")


ORDER_NOT_PAYED_TEXT = ('Це замовлення ми бачимо, але твоя онлайн оплата не пройшла успішно.\n'
                        '\nВаріанти рішення:\n 1️⃣ Ти можеш завершити оплату існуючого замовлення в кабінеті в'
                        ' <a href="fnAPI.ua">fnAPI.ua</a>\n'
                        '\n 2️⃣ Створи нове "замовлення, щоб знов спробувати оплатити її\n\n 3️⃣ Напиши нам в '
                        '<a href="https://t.me/lalavape">Телеграм</a>'
                        ' "змініть спосіб оплати" та ми змінимо її на "Оплата на картку" або "Накладний платіж"')


STOP_TRACKING_TEXT = ("Ну все, я припиняю слідкування 🫡\nЩоб я продовжив слідкувати за"
                      " замовленням - запусти цей процес знову ✌️")


def multiple_orders(orders):
    text = (f'Я бачу декілька замовлень за тоїм номером телефону. А точніше, їх <b>{len(orders)}</b>.\nЩоб я міг краще '
            f'підказ'
            f'ати тобі, обери будь ласка яке саме замовлення ти хочеш перевірити')
    return text

